# Brewfile - Declarative package management for Homebrew
# Run with: brew bundle install

# Taps
tap "homebrew/cask"
# tap "homebrew/cask-fonts" # Deprecated - fonts are now in main cask tap
tap "homebrew/services"
tap "mongodb/brew"

# Core utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "grep"
brew "bc"
brew "jq"
brew "yq"
brew "tree"
brew "wget"
brew "curl"
brew "rsync"

# Shell enhancements
brew "zsh"
brew "zsh-history-substring-search"
brew "starship"
brew "tmux"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "htop"
brew "ncdu"
brew "tldr"
brew "thefuck"

# Development essentials
brew "git"
brew "gh"
brew "git-lfs"
brew "git-flow"
brew "lazygit"
brew "neovim"
brew "vim"
brew "make"
brew "cmake"
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "direnv"  # Load/unload environment variables based on directory
brew "watchman"  # File watching service
brew "mkcert"  # Local HTTPS development certificates

# Programming languages
brew "python@3.13"
brew "python@3.12"
brew "node"
brew "go"
brew "rust"
brew "java"
brew "ruby"

# Language tools
brew "pyenv"
brew "pipx"
brew "uv"
brew "nvm"
brew "pnpm"
brew "yarn"
brew "rbenv"
brew "mise"  # Modern runtime version manager (replaces asdf)

# Containers & Orchestration
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kubectx"
brew "kustomize"
brew "stern"
brew "podman"
brew "docker-compose"
brew "lazydocker"
brew "dive"
brew "ctop"
brew "colima"  # Container runtime for macOS (Docker Desktop alternative)
brew "nerdctl"  # Docker-compatible CLI for containerd

# Infrastructure as Code
brew "terraform"
brew "terragrunt"
brew "packer"
brew "ansible"
brew "ansible-lint"
brew "vault"
brew "consul"

# Cloud tools
brew "awscli"
brew "azure-cli"
brew "google-cloud-sdk"
brew "doctl"
brew "linode-cli"

# Database tools
brew "postgresql@14"
brew "mysql"
brew "redis"
brew "sqlite"
brew "pgcli"
brew "mycli"
brew "litecli"
brew "mongodb-community"

# Network tools
brew "nmap"
brew "masscan"
brew "mtr"
brew "iperf3"
brew "tcpdump"
brew "wireshark", link: false
brew "httpie"
brew "curlie"
brew "grpcurl"
brew "websocat"
brew "dog"
brew "bandwhich"
brew "gping"
brew "trippy"

# Security tools
brew "gnupg"
brew "openssh"
brew "openssl"
brew "trivy"
brew "grype"
brew "checkov"
brew "tfsec"
brew "gitleaks"  # Detect secrets in git repos
brew "trufflehog"  # Find leaked credentials
brew "age"  # Modern encryption tool

# Monitoring
brew "prometheus"
brew "grafana"
brew "loki"

# CI/CD
brew "act"
brew "circleci"
brew "gitlab-runner"

# Media tools
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"
brew "sox"

# Archive tools
brew "p7zip"
brew "unrar"
brew "xz"
brew "zstd"

# Fun stuff
brew "cmatrix"
brew "asciiquarium"
brew "cowsay"
brew "fortune"
brew "lolcat"

# Cask applications - GUI apps

# Terminals
cask "warp"
cask "iterm2"

# Development
cask "visual-studio-code"
cask "sublime-text"
cask "jetbrains-toolbox"
cask "cursor"
cask "github"
cask "sourcetree"
cask "fork"
cask "postman"
cask "insomnia"
cask "tableplus"
cask "dbeaver-community"

# Containers & VMs
cask "orbstack"
cask "utm"

# Cloud & DevOps
cask "lens"
cask "aws-vpn-client"

# Network tools
cask "wireshark"
cask "angry-ip-scanner"
cask "viscosity"
cask "tailscale"
cask "ngrok"

# Productivity
cask "rectangle"
cask "alfred"
cask "obsidian"
cask "notion"
cask "linear-linear"

# Communication
cask "slack"
cask "discord"
cask "zoom"
cask "microsoft-teams"

# Security
cask "1password"
cask "gpg-suite"
cask "yubico-authenticator"

# Additional tools
cask "dash"
cask "proxyman"
cask "gas-mask"
cask "hex-fiend"
cask "cyberduck"
cask "transmit"
cask "stats"
cask "monitorcontrol"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-cascadia-code"
cask "font-sf-mono"

# Mac App Store apps (requires mas CLI)
# mas "Xcode", id: 497799835
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541